In [1]:
a = 10 ; b = 5
c = a * b
print('c = ', c)

c =  50

In [2]:
import pandas as pd

obj = pd.Series([1,2,-3,5])

obj.values

array([ 1,  2, -3,  5], dtype=int64)

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj = pd.Series([1,2,-3,5], index = ['z', 'a', 'x', 'f'])

In [5]:
obj

z    1
a    2
x   -3
f    5
dtype: int64

In [6]:
obj['z']

1

In [7]:
obj[['z', 'f']]

z    1
f    5
dtype: int64

In [8]:
obj2 = obj[['z', 'f']]

In [9]:
obj2

z    1
f    5
dtype: int64

In [10]:
obj*2

z     2
a     4
x    -6
f    10
dtype: int64

In [11]:
# Dictionary
sdata = {
    'Ohio': 3500,
    'Texas': 7100,
    'California': 1400
        }

In [12]:
sdata

{'Ohio': 3500, 'Texas': 7100, 'California': 1400}

In [13]:
# We send sdata a dictionary as a series
obj3 = pd.Series(sdata)

In [14]:
obj3

Ohio          3500
Texas         7100
California    1400
dtype: int64

In [15]:
states = ['California', 'Texas', 'Ohio', 'Oregon']

In [16]:
obj4 = pd.Series(sdata , index = states)

In [17]:
obj4

California    1400.0
Texas         7100.0
Ohio          3500.0
Oregon           NaN
dtype: float64

In [18]:
obj4.isnull()

California    False
Texas         False
Ohio          False
Oregon         True
dtype: bool

In [19]:
obj3 + obj4

California     2800.0
Ohio           7000.0
Oregon            NaN
Texas         14200.0
dtype: float64

In [20]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000,2001,2002,2001,2002],
    'pop': [1.5,1.7,3.6,2.4,2.9]
}

In [21]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [22]:
import pandas as pd
Frame01 = pd.DataFrame(data)

In [23]:
Frame01

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
Frame02 = pd.DataFrame(data,columns=('year', 'pop', 'state'))

In [25]:
Frame02

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada

In [26]:
Frame03 = pd.DataFrame(data,columns=['year', 'pop', 'state', 'debt'], index = ['One', 'Two', 'Three', 'Four', 'Five'])

In [27]:
Frame03

       year  pop   state debt
One    2000  1.5    Ohio  NaN
Two    2001  1.7    Ohio  NaN
Three  2002  3.6    Ohio  NaN
Four   2001  2.4  Nevada  NaN
Five   2002  2.9  Nevada  NaN

In [28]:
Frame03['debt'] = 20

In [29]:
Frame03

       year  pop   state  debt
One    2000  1.5    Ohio    20
Two    2001  1.7    Ohio    20
Three  2002  3.6    Ohio    20
Four   2001  2.4  Nevada    20
Five   2002  2.9  Nevada    20

In [30]:
val = pd.Series([-1.2,-1.5,-1.7], index = ['Two', 'Three', 'Five'])

In [31]:
val

Two     -1.2
Three   -1.5
Five    -1.7
dtype: float64

In [32]:
# A la columna de 'debt' se le asigna los valores de val
Frame03['debt'] = val

In [33]:
Frame03

       year  pop   state  debt
One    2000  1.5    Ohio   NaN
Two    2001  1.7    Ohio  -1.2
Three  2002  3.6    Ohio  -1.5
Four   2001  2.4  Nevada   NaN
Five   2002  2.9  Nevada  -1.7

In [34]:
# Se crea la columna 'eastern'
Frame03['eastern'] = Frame03.state == 'Ohio'

In [35]:
Frame03

       year  pop   state  debt  eastern
One    2000  1.5    Ohio   NaN     True
Two    2001  1.7    Ohio  -1.2     True
Three  2002  3.6    Ohio  -1.5     True
Four   2001  2.4  Nevada   NaN    False
Five   2002  2.9  Nevada  -1.7    False

In [36]:
# Eliminar una columna
del Frame03['eastern']

In [37]:
Frame03

       year  pop   state  debt
One    2000  1.5    Ohio   NaN
Two    2001  1.7    Ohio  -1.2
Three  2002  3.6    Ohio  -1.5
Four   2001  2.4  Nevada   NaN
Five   2002  2.9  Nevada  -1.7

In [38]:
# Visualizar nombres de columnas
Frame03.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [39]:
# Transposiciona, hace que cambien el eje
Frame02.T

          0     1     2       3       4
year   2000  2001  2002    2001    2002
pop     1.5   1.7   3.6     2.4     2.9
state  Ohio  Ohio  Ohio  Nevada  Nevada

In [40]:
# Índice compuesto
Frame03.index.name = 'year'; Frame03.index.name = 'state'

In [41]:
Frame03

       year  pop   state  debt
state
One    2000  1.5    Ohio   NaN
Two    2001  1.7    Ohio  -1.2
Three  2002  3.6    Ohio  -1.5
Four   2001  2.4  Nevada   NaN
Five   2002  2.9  Nevada  -1.7

In [42]:
import pandas as pd

# Lectura de un archivo
file01 = pd.read_csv('D:/housing.csv')

file01

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [43]:
# Análisis sencillo de un archivo
file01.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [44]:
file01.iat[0,0]

-122.23

In [45]:
file01.at[100,'population']

2304.0

In [46]:
# Convertimos csv a json
file01.to_json('housing.json')

In [47]:
# Asignamos el json a una variable
filejson = pd.read_json('housing.json')

In [48]:
filejson

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41,880,129.0,322,126,8.3252,452600,NEAR BAY
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,358500,NEAR BAY
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,352100,NEAR BAY
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,341300,NEAR BAY
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,342200,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25,1665,374.0,845,330,1.5603,78100,INLAND
20636,-121.21,39.49,18,697,150.0,356,114,2.5568,77100,INLAND
20637,-121.22,39.43,17,2254,485.0,1007,433,1.7000,92300,INLAND
20638,-121.32,39.43,18,1860,409.0,741,349,1.8672,84700,INLAND
20639,-121.24,39.37,16,2785,616.0,1387,530,2.3886,89400,INLAND

In [49]:
# Install parquet
pip install parquet

Requirement already satisfied: parquet in d:\programas\anaconda\lib\site-packages (1.3.1)
Requirement already satisfied: thriftpy2 in d:\programas\anaconda\lib\site-packages (from parquet) (0.4.14)
Requirement already satisfied: ply<4.0,>=3.4 in d:\programas\anaconda\lib\site-packages (from thriftpy2->parquet) (3.11)
Note: you may need to restart the kernel to use updated packages.

In [50]:
# Install pyarrow
pip install pyarrow

Requirement already satisfied: pyarrow in d:\programas\anaconda\lib\site-packages (9.0.0)
Requirement already satisfied: numpy>=1.16.6 in d:\programas\anaconda\lib\site-packages (from pyarrow) (1.21.5)
Note: you may need to restart the kernel to use updated packages.

In [52]:
file01.to_parquet('housing.parquet')

In [53]:
file02 = pd.read_parquet('housing.parquet')

In [54]:
file02

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND